### Create a Python connection with SQL database and retrieve the results of the last two queries 
### (also mentioned below) as dataframes:from sqlalchemy import create_engine # let's connect to SQL

In [25]:
import pandas as pd
from getpass import getpass

In [2]:
from getpass import getpass
from sqlalchemy import create_engine

In [3]:
password = getpass("Please, kindly insert your password:")
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'

Please, kindly insert your password:········

In [4]:
engine = create_engine(connection_string)

pip install --upgrade 'sqlalchemy<2.0'

In [26]:
may_rental = pd.read_sql_query('SELECT * FROM sakila.rental_may', engine)
may_rental.head(1)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,month,months
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,None,None

### Check the number of rentals for each customer for May

In [20]:
may_total = pd.read_sql_query('SELECT customer_id, COUNT(customer_id) AS may_total FROM rental_may GROUP BY customer_id', engine)
may_total.head(1)

   customer_id  may_total
0          130          2

In [42]:
june_rental = pd.read_sql_query('SELECT * FROM sakila.rental_june', engine)
june_rental.head(1)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,month,months
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53,None,None

### Check the number of rentals for each customer for June

In [43]:
june_total = pd.read_sql_query('SELECT customer_id, COUNT(customer_id) AS june_total FROM rental_june GROUP BY customer_id', engine)
june_total.head(1)

   customer_id  june_total
0          416           5

### Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

In [50]:
may_june = may_total.merge(june_total, left_index=True, right_index=True, how='inner')
may_june   ## First I'm making a new dataframe

     customer_id_x  may_total  customer_id_y  june_total
0              130          2            416           5
1              459          1            516           6
2              408          3            239           5
3              333          1            285           3
4              222          5            310           6
..             ...        ...            ...         ...
515            191          2            247           1
516            351          1            436           1
517             10          1             72           1
518            136          1            106           2
519             61          1            160           3

[520 rows x 4 columns]

In [51]:
def may_june_count():   ## this function compare for each customer if more rental have been made in may or june
    may_june['greater_in_may'] = ["may_total"] > ["june_total"]
    may_june['greater_in_june'] = ["may_total"] < ["june_total"]
    return may_june.head()

In [54]:
may_june_count()

,customer_id_x,may_total,customer_id_y,june_total,greater_in_may,greater_in_june
0,130,2,416,5,True,False
1,459,1,516,6,True,False
2,408,3,239,5,True,False
3,333,1,285,3,True,False
4,222,5,310,6,True,False